# Making two tables of students in the class

## Gathering records
Everybody submit their information in two dictionaries

In [1]:
import pandas as pd

In [5]:
# Example
general = {
    0:dict(name='Tian', gender='F', age='100', status='student')
}
# potential role include PO, SM, Dev
study = {
    0:dict(school='Yale', major='Immunobiology', computer_language='python, scala, java', role=None)
}

In [6]:
general_tb = pd.DataFrame(general).T.reset_index()
general_tb

   index  age gender  name   status
0      0  100      F  Tian  student

In [7]:
study_tb = pd.DataFrame(study).T.reset_index()
study_tb

   index    computer_language          major  role school
0      0  python, scala, java  Immunobiology  None   Yale

## Select a record

In [8]:
# select a record
print general_tb[general_tb['age'] > 50]
print '*' * 50
print general_tb[general_tb['age'] > 50]['status']
print '*' * 50
print general_tb.ix[general_tb['age'] > 50, 'status']

   index  age gender  name   status
0      0  100      F  Tian  student
**************************************************
0    student
Name: status, dtype: object
**************************************************
0    student
Name: status, dtype: object

C:\Users\chatc\Anaconda3\envs\itds_bootcamp\lib\site-packages\ipykernel_launcher.py:6: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

## Change a value of a record

In [9]:
general_tb.ix[general_tb['age'] > 50, 'status'] = 'instructor'

In [10]:
general_tb

   index  age gender  name      status
0      0  100      F  Tian  instructor

# Practice
----

## Collect student information in two csv files
Load the two csv files using pandas

In [2]:
# general_tb = pd.read_csv(<path>)
general_tb = pd.read_csv("C:/Users/chatc/Documents/GitHub/intro_to_data_science_2017/data/students/file1.csv")
# study_tb =pd.read_csv(<path>)
study_tb = pd.read_csv("C:/Users/chatc/Documents/GitHub/intro_to_data_science_2017/data/students/file2.csv")
general_tb
study_tb

,index,computer_language,major,role,school
0,0,"python, scala, java",Immunobiology,None,Yale
1,1,SAS,Actuarial Science,Developer,Boston
2,2,SAS python,Information Technology,Developer,UT Dallas
3,3,SAS,MBA,developer,UT Dallas
4,4,"python, c",computer science,Developer,Umass
5,5,c++,"EE, math",product owner,tech tech/UTD
6,6,"python, R, java",computer science,Developer,UT Dallas
7,7,"SAS, R, Python",Industrial Engineering,Developer,Texas A&M

## Sort the records based on student age

In [3]:
# http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.sort_values.html
gs_age = general_tb.sort_values(by='age', ascending=1)
gs_age

   index  age gender     name   status
4      4   23      M     Tian  student
7      7   24      F   Biying  student
1      1   25      M  Jinghua  student
6      6   25      M   Wenhan  student
2      2   27      M  Guangxi  student
3      3   99      F     Jing     work
0      0  100      F     Tian  student
5      5  888      F    Meryl     work

## Join two tables

In [4]:
# http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html
tb_merge = pd.merge(general_tb, study_tb, on='index', how='left')
tb_merge

,index,age,gender,name,status,computer_language,major,role,school
0,0,100,F,Tian,student,"python, scala, java",Immunobiology,None,Yale
1,1,25,M,Jinghua,student,SAS,Actuarial Science,Developer,Boston
2,2,27,M,Guangxi,student,SAS python,Information Technology,Developer,UT Dallas
3,3,99,F,Jing,work,SAS,MBA,developer,UT Dallas
4,4,23,M,Tian,student,"python, c",computer science,Developer,Umass
5,5,888,F,Meryl,work,c++,"EE, math",product owner,tech tech/UTD
6,6,25,M,Wenhan,student,"python, R, java",computer science,Developer,UT Dallas
7,7,24,F,Biying,student,"SAS, R, Python",Industrial Engineering,Developer,Texas A&M

## Count how many Female and Male students in our class

In [14]:
# http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.groupby.html

general_tb.groupby('gender').count()

        index  age  name  status
gender
F           4    4     4       4
M           4    4     4       4

## Find out who knows the highest number of languages

In [5]:
# http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.apply.html

tb_merge['language_number'] = tb_merge['computer_language'].apply(lambda x: len(x.split(',')))

print tb_merge[tb_merge['language_number'] == tb_merge['language_number'].max()]['name']

0      Tian
6    Wenhan
7    Biying
Name: name, dtype: object

# Challenge the other team
Think about a question for the other team that they can solve with these two tables